cask_args appdir: "/Applications"

tap "beeftornado/rmtree"
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "nodenv/nodenv"
tap "puma/puma"
tap "thoughtbot/formulae"
tap "timescale/tap"

brew "ansible"
brew "asdf"
brew "bat"
brew "colordiff"
brew "coreutils"
brew "curl"
brew "direnv"
brew "docker-compose"
brew "docker-compose-completion"
brew "fish"
brew "fzf"
brew "git"
brew "github/gh/gh"
brew "gnupg"
brew "heroku/brew/heroku"
brew "knock"
brew "mas"
brew "neovim"
brew "node-build", args: ["HEAD"]
brew "nodenv"
brew "nodenv/nodenv/nodenv-aliases"
brew "nodenv/nodenv/nodenv-default-packages"
brew "nodenv/nodenv/nodenv-each"
brew "nodenv/nodenv/nodenv-package-json-engine"
brew "nodenv/nodenv/nodenv-package-rehash"
brew "nodenv/nodenv/nodenv-update"
brew "pinentry-mac"
brew "postgresql"
brew "puma/puma/puma-dev"
brew "python"
brew "rbenv"
brew "rbenv-aliases"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "ruby-build"
brew "thoughtbot/formulae/rcm"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "whalebrew"
brew "ykman"
brew "zsh"

cask "1password"
cask "alfred"
cask "arq"
cask "basecamp"
cask "browserstacklocal"
cask "docker"
cask "dropbox"
cask "figma"
cask "firefox"
cask "firefox-developer-edition"
cask "font-hack"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "google-chrome-canary"
cask "iterm2"
cask "microsoft-teams"
cask "nextcloud"
cask "ngrok"
cask "notion"
cask "pocket-casts"
cask "sensiblesidebuttons"
cask "sizeup"
cask "sketch"
cask "slack"
cask "spotify"
cask "the-unarchiver"
cask "transmit"
cask "viscosity"
cask "visual-studio-code"
cask "vmware-fusion"
cask "vorta"

mas "AdGuard for Safari", id: 1440147259
mas "Postico", id: 1031280567
mas "Spark", id: 1176895641
mas "Todoist", id: 585829637
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
