cask_args appdir: "/Applications"

tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "beeftornado/rmtree"
tap "heroku/brew"
tap "nodenv/nodenv"
tap "puma/puma"
tap "thoughtbot/formulae"

brew "caddy"
brew "colordiff"
brew "coreutils"
brew "curl"
brew "fzf"
brew "git"
brew "gnupg"
brew "go"
brew "heroku"
brew "htop-osx"
brew "hub"
brew "knock"
brew "mas"
brew "mercurial"
brew "node-build"
brew "nodenv"
brew "nodenv-aliases"
brew "nodenv-package-json-engine"
brew "nodenv-package-rehash"
brew "nodenv-update"
brew "openssl"
brew "pinentry-mac"
brew "puma-dev"
brew "rbenv"
brew "rbenv-aliases"
brew "rbenv-bundle-exec"
brew "rcm"
brew "reattach-to-user-namespace"
brew "ruby-build"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "ykman"
brew "zsh"

cask "1password"
cask "adobe-creative-cloud"
cask "alfred"
cask "android-file-transfer"
cask "android-platform-tools"
cask "arq"
cask "basecamp"
cask "calibre"
cask "daisydisk"
cask "dash"
cask "docker"
cask "dropbox"
cask "figma"
cask "firefox"
cask "font-hack"
cask "google-chrome"
cask "google-chrome-canary"
cask "hazel"
cask "imagealpha"
cask "imageoptim"
cask "iterm2-nightly"
cask "karabiner"
cask "ngrok"
cask "psequel"
cask "sizeup"
cask "slack"
cask "spotify"
cask "spotify-notifications"
cask "the-unarchiver"
cask "transmit"
cask "viscosity"
cask "vmware-fusion"

mas "Keynote", id: 409183694
mas "Xcode", id: 497799835
mas "Pages", id: 409201541
